In [6]:
import pandas as pd

df = pd.read_csv('data_sf.xls')
df.tail()

,Unnamed: 0,Name,Age,Nationality,Club,Value,Wage,Position,Crossing,Finishing,...,Penalties,Composure,Marking,StandingTackle,SlidingTackle,GKDiving,GKHandling,GKKicking,GKPositioning,GKReflexes
12892,13121,J. Lundstram,19,England,Crewe Alexandra,1100000,1000,CM,34,38,...,43,45,40,48,47,10,13,7,8,9
12893,13122,N. Christoffersson,19,Sweden,Trelleborgs FF,60000,1000,ST,23,52,...,43,42,22,15,19,10,9,9,5,12
12894,13123,B. Worman,16,England,Cambridge United,60000,1000,ST,25,40,...,55,41,32,13,11,6,5,10,6,13
12895,13124,D. Walker-Rice,17,England,Tranmere Rovers,60000,1000,RW,44,50,...,50,46,20,25,27,14,6,14,8,9
12896,13125,G. Nugent,16,England,Tranmere Rovers,60000,1000,CM,41,34,...,33,43,40,43,50,10,15,9,12,9

In [23]:
club_list = df['Club'].value_counts()
top_clubs = club_list[club_list == club_list.max()]
bottom_club = club_list[club_list == club_list[-1]]
bottom_club

Atlético Mineiro    6
Name: Club, dtype: int64

In [40]:
pos = df['Position'].value_counts(normalize=True)
pos.loc[pos > 0.1].index

Index(['GK', 'ST', 'CB'], dtype='object')

In [44]:
pos = df['Position'].value_counts(normalize=True)
pos.loc[pos < 0.01]

LS     0.009382
RS     0.008839
RWB    0.005428
LWB    0.004652
CF     0.003954
LF     0.000620
RF     0.000465
LAM    0.000465
RAM    0.000388
Name: Position, dtype: float64

In [65]:
small_df = df[df.columns[0:7]].head(25)
w = small_df.Wage.value_counts(bins=4)
w.index
w.index[3].left
w.index[1].right
small_df['Wage'] > w.index[3].left
small_df.loc[small_df['Wage'] > w.index[3].left]

   Unnamed: 0       Name  Age Nationality          Club      Value    Wage
0           0   L. Messi   31   Argentina  FC Barcelona  110500000  565000
7           7  L. Suárez   31     Uruguay  FC Barcelona   80000000  455000

## Задания

In [76]:
df['FKAccuracy'].value_counts(bins=5)

(21.2, 39.4]     4859
(39.4, 57.6]     3957
(57.6, 75.8]     2108
(2.908, 21.2]    1760
(75.8, 94.0]      213
Name: FKAccuracy, dtype: int64

In [88]:
s = small_df['Club'].value_counts()
s.index
s_df = s.reset_index()
s_df.columns = ['Club', 'Players Count']
display(s_df)

                  Club  Players Count
0          Real Madrid              4
1         FC Barcelona              4
2      Manchester City              3
3             Juventus              3
4      Atlético Madrid              3
5              Chelsea              2
6    FC Bayern München              2
7  Paris Saint-Germain              2
8    Tottenham Hotspur              1
9    Manchester United              1

In [99]:
spanish = df[df['Nationality'] == 'Spain']['Wage']
spanish.value_counts(normalize=True, bins=4)

(620.999, 95750.0]      0.970194
(95750.0, 190500.0]     0.016393
(190500.0, 285250.0]    0.008942
(285250.0, 380000.0]    0.004471
Name: Wage, dtype: float64

In [107]:
lads = df[df['Club'] == 'Manchester United']
lads['Nationality'].nunique()

13

In [199]:
# Alex Sandro, Douglas Costa
br1 = df[(df['Nationality'] == 'Brazil') & (df['Club'] == 'Juventus')]
br1.Name.unique()

array(['Alex Sandro', 'Douglas Costa'], dtype=object)

In [146]:
df[df['Age'] > 35].Club.value_counts()

Club Atlético Huracán             4
Hokkaido Consadole Sapporo        4
Gimnasia y Esgrima La Plata       3
Club Atlético Talleres            3
Hammarby IF                       3
                                 ..
Guangzhou Evergrande Taobao FC    1
Rayo Vallecano                    1
Colo-Colo                         1
FC Girondins de Bordeaux          1
IF Elfsborg                       1
Name: Club, Length: 212, dtype: int64

In [150]:
df[df['Nationality'] == 'Argentina']['Age'].value_counts(bins=4)

(22.25, 28.5]      200
(15.974, 22.25]    197
(28.5, 34.75]      128
(34.75, 41.0]       49
Name: Age, dtype: int64

In [156]:
df[df['Nationality'] == 'Spain']['Age'].value_counts(normalize=True)

21    0.117735
22    0.095380
20    0.077496
23    0.071535
25    0.064083
27    0.062593
24    0.059613
28    0.053651
26    0.053651
29    0.047690
19    0.047690
18    0.038748
30    0.038748
31    0.032787
32    0.032787
33    0.031297
34    0.022355
17    0.013413
35    0.011923
36    0.010432
37    0.008942
39    0.002981
16    0.002981
38    0.001490
Name: Age, dtype: float64

In [173]:
br2 = df.groupby(['Position'])['Wage'].sum()
br3 = br2.sort_values(ascending=False).reset_index()
br3[br3['Wage'] > 5000000]

  Position      Wage
0       ST  11873000
1       GK   8784000
2       CB   7476000
3       CM   6194000
4       LB   6096000
5      CAM   5500000
6       LM   5440000
7       RM   5098000
8       RB   5034000

In [200]:
df.groupby(['Position'])[['Wage','Value']].mean().sort_values(['Value'] ,ascending=False).loc['LF']

Wage        75125.0
Value    27362500.0
Name: LF, dtype: float64

In [222]:
mm = df.groupby(['Club'])['Wage'].agg(['mean', 'median'])
mnmn = mm.loc[mm['mean'] == mm['median']]

mnmn.sort_values(['mean'], ascending=False).iloc[0]

mean      13000.0
median    13000.0
Name: Cruzeiro, dtype: float64

In [224]:
df[df['Club'] == 'Chelsea']['Wage'].sum()

2035000

In [232]:
df[df['Nationality'] == 'Argentina'].groupby(['Age'])['Wage'].max().loc[[20, 30]]

Age
20     54000
30    300000
Name: Wage, dtype: int64

In [234]:
df[df['Nationality'] == 'Argentina'].groupby(['Age'])['Wage'].min().loc[30]

1000

In [237]:
df[(df['Club'] == 'FC Barcelona') & (df['Nationality'] == 'Argentina')][['Strength', 'Balance']].max()

Strength    59
Balance     95
dtype: int64